wolgwang1729/SoB-SeedSigner-Bootloader-Journey/Phase_9/hello_world_esp32p4_stateless_payload/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
# Support v1.3 silicon (our dev board)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# PSRAM configuration (match bootloader: 80MHz Octal)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_USE_MEMMAP=y
CONFIG_ESP_SYSTEM_HW_STACK_GUARD=n
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_TASK_WDT_ENABLE_AT_STARTUP=n

# Disable PMP IDRAM split so memory permissions stay RWX for payload
CONFIG_ESP_SYSTEM_PMP_IDRAM_SPLIT=n

# Partition table offset (match bootloader layout)
CONFIG_PARTITION_TABLE_OFFSET=0x20000

# Virtual eFuse Configuration (non-destructive)
CONFIG_EFUSE_VIRTUAL=y
CONFIG_EFUSE_VIRTUAL_KEEP_IN_FLASH=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE=y
CONFIG_FREERTOS_UNICORE=y

# Console UART via GPIO 37/38 → bridge chip → /dev/ttyACM0
CONFIG_ESP_CONSOLE_UART=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200



